In [1]:
import pandas
import calendar

In [2]:
df = pandas.read_csv('full.txt', header=None, skiprows=2, sep='\s+', names=['year', 'month', 'day', 'hour', 'minute', 'second', 'latitude', 'lotitude', 'depth', 'magnitude'])

In [3]:
df

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [4]:
df.index.name = 'event'

In [5]:
df

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude
event,,,,,,,,,,
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [6]:
df['month'] = df['month'].str.title()

In [7]:
df

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude
event,,,,,,,,,,
0,1964,Feb,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,Apr,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,Apr,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,Apr,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,Apr,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,Apr,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,Apr,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,Apr,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,Apr,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,Apr,9,5,15,5.0,39.8007,21.8948,7,1.2

In [8]:
month_abbr_as_ints = dict((x,y) for (y,x) in enumerate(calendar.month_abbr))
month_abbr_as_ints

{'': 0,
 'Jan': 1,
 'Feb': 2,
 'Mar': 3,
 'Apr': 4,
 'May': 5,
 'Jun': 6,
 'Jul': 7,
 'Aug': 8,
 'Sep': 9,
 'Oct': 10,
 'Nov': 11,
 'Dec': 12}

In [9]:
df['month'].replace(month_abbr_as_ints, inplace=True)

In [10]:
df

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude
event,,,,,,,,,,
0,1964,2,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,4,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,4,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,4,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,4,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,4,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,4,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,4,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,4,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,4,9,5,15,5.0,39.8007,21.8948,7,1.2

In [11]:
df['datetime'] = (
    df['year'].astype(str) + '-' + 
    df['month'].astype(str) + '-' +
    df['day'].astype(str) + ' ' +
    df['hour'].astype(str) + ':' +
    df['minute'].astype(str) + ':' +
    df['second'].astype(str)
)

In [12]:
df

,year,month,day,hour,minute,second,latitude,lotitude,depth,magnitude,datetime
event,,,,,,,,,,,
0,1964,2,24,23,30,25.0,38.9000,23.9000,10,5.3,1964-2-24 23:30:25.0
1,1964,4,11,16,0,0.0,39.7500,25.2500,10,5.7,1964-4-11 16:0:0.0
2,1964,4,21,8,14,40.0,38.5000,22.2500,10,4.5,1964-4-21 8:14:40.0
3,1964,4,24,3,49,58.0,38.0000,21.8000,10,5.0,1964-4-24 3:49:58.0
4,1964,4,29,4,21,0.0,39.2500,23.7500,10,5.8,1964-4-29 4:21:0.0
...,...,...,...,...,...,...,...,...,...,...,...
313395,2021,4,9,5,0,7.4,39.7856,21.9081,5,0.6,2021-4-9 5:0:7.4
313396,2021,4,9,5,0,21.9,39.7920,21.9328,5,1.5,2021-4-9 5:0:21.9
313397,2021,4,9,5,1,6.5,39.7160,22.1947,8,1.0,2021-4-9 5:1:6.5
313398,2021,4,9,5,2,5.6,39.7929,21.9154,6,1.0,2021-4-9 5:2:5.6
313399,2021,4,9,5,15,5.0,39.8007,21.8948,7,1.2,2021-4-9 5:15:5.0

In [13]:
df.drop(columns = ['year', 'month', 'day', 'hour', 'minute', 'second'], inplace = True)

In [14]:
df

        latitude  lotitude  depth  magnitude              datetime
event
0        38.9000   23.9000     10        5.3  1964-2-24 23:30:25.0
1        39.7500   25.2500     10        5.7    1964-4-11 16:0:0.0
2        38.5000   22.2500     10        4.5   1964-4-21 8:14:40.0
3        38.0000   21.8000     10        5.0   1964-4-24 3:49:58.0
4        39.2500   23.7500     10        5.8    1964-4-29 4:21:0.0
...          ...       ...    ...        ...                   ...
313395   39.7856   21.9081      5        0.6      2021-4-9 5:0:7.4
313396   39.7920   21.9328      5        1.5     2021-4-9 5:0:21.9
313397   39.7160   22.1947      8        1.0      2021-4-9 5:1:6.5
313398   39.7929   21.9154      6        1.0      2021-4-9 5:2:5.6
313399   39.8007   21.8948      7        1.2     2021-4-9 5:15:5.0

[313400 rows x 5 columns]

In [15]:
list(df.columns.values)

['latitude', 'lotitude', 'depth', 'magnitude', 'datetime']

In [16]:
df = df[['datetime', 'latitude', 'lotitude', 'depth', 'magnitude']]

In [17]:
df

                    datetime  latitude  lotitude  depth  magnitude
event
0       1964-2-24 23:30:25.0   38.9000   23.9000     10        5.3
1         1964-4-11 16:0:0.0   39.7500   25.2500     10        5.7
2        1964-4-21 8:14:40.0   38.5000   22.2500     10        4.5
3        1964-4-24 3:49:58.0   38.0000   21.8000     10        5.0
4         1964-4-29 4:21:0.0   39.2500   23.7500     10        5.8
...                      ...       ...       ...    ...        ...
313395      2021-4-9 5:0:7.4   39.7856   21.9081      5        0.6
313396     2021-4-9 5:0:21.9   39.7920   21.9328      5        1.5
313397      2021-4-9 5:1:6.5   39.7160   22.1947      8        1.0
313398      2021-4-9 5:2:5.6   39.7929   21.9154      6        1.0
313399     2021-4-9 5:15:5.0   39.8007   21.8948      7        1.2

[313400 rows x 5 columns]

In [18]:
df.dtypes

datetime      object
latitude     float64
lotitude     float64
depth          int64
magnitude    float64
dtype: object

In [19]:
df['datetime'] = pandas.to_datetime(df['datetime'])

In [20]:
df

                      datetime  latitude  lotitude  depth  magnitude
event
0      1964-02-24 23:30:25.000   38.9000   23.9000     10        5.3
1      1964-04-11 16:00:00.000   39.7500   25.2500     10        5.7
2      1964-04-21 08:14:40.000   38.5000   22.2500     10        4.5
3      1964-04-24 03:49:58.000   38.0000   21.8000     10        5.0
4      1964-04-29 04:21:00.000   39.2500   23.7500     10        5.8
...                        ...       ...       ...    ...        ...
313395 2021-04-09 05:00:07.400   39.7856   21.9081      5        0.6
313396 2021-04-09 05:00:21.900   39.7920   21.9328      5        1.5
313397 2021-04-09 05:01:06.500   39.7160   22.1947      8        1.0
313398 2021-04-09 05:02:05.600   39.7929   21.9154      6        1.0
313399 2021-04-09 05:15:05.000   39.8007   21.8948      7        1.2

[313400 rows x 5 columns]

In [21]:
df.dtypes

datetime     datetime64[ns]
latitude            float64
lotitude            float64
depth                 int64
magnitude           float64
dtype: object